Reports/ИА_ОтчетПоЗагрузкеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИА_ОтчетПоЗагрузкеСотрудников</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ИА_АдресацияЗадачПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_АдресацияЗадачПланаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_ВидыИтогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВидыИтогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднееЗначение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОргСхема</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТерминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТерминалаОргСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоднятьВверх</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВСхеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОргсхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСтатистик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотографии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЦКП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗаполненииСтатистик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_УведомленияОЗаполненииСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВложеннаяОргсхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВложеннуюОргсхему</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ИА_ОтчетПоЗагрузкеСотрудников/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВывестиОтчетНаСервере() 	
	
	Об = РеквизитФормыВЗначение("Объект");
	Макет = Об.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОргСхемаСотрудники.ФизЛицо КАК Сотрудник,
		|	ОргСхемаСотрудники.Ссылка КАК Пост,
		|	0 КАК ВходящиеЗадачи,
		|	0 КАК ВРаботеЗадачи,
		|	0 КАК ИсходящиеЗадачи,
		|	0 КАК ВсеЗадачи,
		|	0 КАК ВыполненныеЗадачи,
		|	0 КАК ВидСтатистики,
		|	0 КАК Аналитика1,
		|	0 КАК Аналитика2,
		|	0 КАК Аналитика3,
		|	0 КАК ЗначениеСтатистики
		|ИЗ
		|	Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
		|ГДЕ
		|	НЕ ОргСхемаСотрудники.Ссылка.ПометкаУдаления
		|	И ОргСхемаСотрудники.Ссылка В ИЕРАРХИИ(&Ссылка)";
		
		Если ЗначениеЗаполнено(Пост) Тогда
			Запрос.Текст = Запрос.Текст + " И ОргСхемаСотрудники.Ссылка = &Пост ";
			Запрос.УстановитьПараметр("Пост", Пост);
		КонецЕсли;	
		Если ЗначениеЗаполнено(Сотрудник) Тогда
			Запрос.Текст = Запрос.Текст + " И ОргСхемаСотрудники.ФизЛицо = &Сотрудник ";
			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + 
		" ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Незанятые посты"",
		|	ОргСхема.Ссылка,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	Справочник.ОргСхема КАК ОргСхема
		|ГДЕ
		|	НЕ ОргСхема.ПометкаУдаления
		|	И ОргСхема.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И НЕ ОргСхема.Ссылка В
		|				(ВЫБРАТЬ
		|					ОргСхемаСотрудники.Ссылка
		|				ИЗ
		|					Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
		|				ГДЕ
		|					НЕ ОргСхемаСотрудники.Ссылка.ПометкаУдаления
		|					И ОргСхемаСотрудники.Ссылка В ИЕРАРХИИ (&Ссылка))";
		
		Если ЗначениеЗаполнено(Пост) Тогда
			Запрос.Текст = Запрос.Текст + "	И ОргСхема.Ссылка = &Пост";
			Запрос.УстановитьПараметр("Пост", Пост);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + 
		" ИТОГИ
		|	СУММА(ВходящиеЗадачи),
		|	СУММА(ВРаботеЗадачи),
		|	СУММА(ИсходящиеЗадачи),
		|	СУММА(ВсеЗадачи),
		|	СУММА(ВыполненныеЗадачи),
		|	СУММА(ВидСтатистики),
		|	СУММА(Аналитика1),
		|	СУММА(Аналитика2),
		|	СУММА(Аналитика3),
		|	СУММА(ЗначениеСтатистики)
		|ПО
		|	Сотрудник,
		|	Пост";
		
	Запрос.УстановитьПараметр("Ссылка", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	тзВходящие = ПолучитьВходящие(Период.ДатаНачала, Период.ДатаОкончания);
	тзВРаботе = ПолучитьВРаботе(Период.ДатаНачала, Период.ДатаОкончания);
	тзИсходящие = ПолучитьИсходящие(Период.ДатаНачала, Период.ДатаОкончания);
	тзВсе = ПолучитьВсе(Период.ДатаНачала, Период.ДатаОкончания);
	тзВыполненные = ПолучитьВыполненные(Период.ДатаНачала, Период.ДатаОкончания);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьСотрудник = Макет.ПолучитьОбласть("Сотрудник");
	ОбластьПост = Макет.ПолучитьОбласть("Пост");
	ОбластьДетали1 = Макет.ПолучитьОбласть("Детали1");
	ОбластьДетали2 = Макет.ПолучитьОбласть("Детали2");
	ОбластьДетали3 = Макет.ПолучитьОбласть("Детали3");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаСотрудник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСотрудник.Следующий() Цикл
		Если ВыборкаСотрудник.Сотрудник <> "Незанятые посты" И ТолькоНезанятыеПосты Тогда
			Продолжить;
		ИначеЕсли ВыборкаСотрудник.Сотрудник = "Незанятые посты" И ЗначениеЗаполнено(Сотрудник) Тогда
			Продолжить;	
		КонецЕсли;	
		
		Отбор = Новый Структура("ФизЛицо", ВыборкаСотрудник.Сотрудник);
		масВхСотр = тзВходящие.НайтиСтроки(Отбор);
		масВРаботеСотр = тзВРаботе.НайтиСтроки(Отбор);
		тзИсходящиеК = тзИсходящие.Скопировать();
		тзИсходящиеК.Свернуть("Задача, ФизЛицо");  //удаляем дублирующиеся задачи
		масИсхСотр = тзИсходящиеК.НайтиСтроки(Отбор);
		тзВсеК = тзВсе.Скопировать();
		//Контекст = Новый Структура("АвторПольз", ВыборкаСотрудник.Сотрудник);
		Контекст = ВыборкаСотрудник.Сотрудник;
		масВсеСотр = ИА_БФКС.ТЗФ_ФильтрПоУсловию(тзВсеК, "СтрокаТЗ.ПользовательФизЛицо = Контекст ИЛИ СтрокаТЗ.АвторФизЛицо = Контекст", Контекст);
		ВсеКоличество = масВсеСотр.Количество();
		//масВыполненныеСотр = тзВыполненные.НайтиСтроки(Отбор);
		тзВыполненныеК = тзВыполненные.Скопировать();
		масВыполненныеСотр = ИА_БФКС.ТЗФ_ФильтрПоУсловию(тзВыполненныеК, "СтрокаТЗ.ПользовательФизЛицо = Контекст ИЛИ СтрокаТЗ.АвторФизЛицо = Контекст", Контекст);
		ВыполненныеКоличество = масВыполненныеСотр.Количество();
		ОбластьСотрудник.Параметры.Заполнить(ВыборкаСотрудник);
		ОбластьСотрудник.Параметры.ВходящиеЗадачиСотрудник = масВхСотр.Количество();
		ОбластьСотрудник.Параметры.ВРаботеЗадачиСотрудник = масВРаботеСотр.Количество();
		ОбластьСотрудник.Параметры.ИсходящиеЗадачиСотрудник = масИсхСотр.Количество();
		ОбластьСотрудник.Параметры.ВсеЗадачиСотрудник = ВсеКоличество;
		ПроцентВыполненияСотр = ?(ВсеКоличество <> 0, ВыполненныеКоличество / ВсеКоличество * 100, 0);
		ОбластьСотрудник.Параметры.ВыполненныеЗадачиСотрудник = Строка(Окр(ПроцентВыполненияСотр, 2, 2)) + "%";

		
		ТабДок.Вывести(ОбластьСотрудник, ВыборкаСотрудник.Уровень());
	
		ВыборкаПост = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаПост.Следующий() Цикл
			ОбластьПост.Параметры.Заполнить(ВыборкаПост);
			ОбластьПост.Параметры.Пост = ВыборкаПост.Пост.наименование;
			ТабДок.Вывести(ОбластьПост, ВыборкаПост.Уровень());
			
			Отбор = Новый Структура("Пост", ВыборкаПост.Пост);
			масВх = тзВходящие.НайтиСтроки(Отбор);
			масВРаботе = тзВРаботе.НайтиСтроки(Отбор);
			масИсх = тзИсходящие.НайтиСтроки(Отбор);
			масВсе = тзВсе.НайтиСтроки(Отбор);
			масВсе = тзВсе.НайтиСтроки(Отбор);
			масВыполненные = тзВыполненные.НайтиСтроки(Отбор);
			
			НастройкаСтатистик = ВыборкаПост.Пост.НастройкаСтатистик;
			
			ОбластьДетали1.Параметры.ВходящиеЗадачи = масВх.Количество();
			ОбластьДетали1.Параметры.ВРаботеЗадачи = масВРаботе.Количество();
			ОбластьДетали1.Параметры.ИсходящиеЗадачи = масИсх.Количество();
			ОбластьДетали2.Параметры.ВсеЗадачи = масВсе.Количество();
			ПроцентВыполнения = ?(масВсе.Количество() <> 0, масВыполненные.Количество() / масВсе.Количество() * 100, 0);
			ОбластьДетали2.Параметры.ВыполненныеЗадачи = Строка(Окр(ПроцентВыполнения, 2, 2)) + "%";
			ТабДок.Вывести(ОбластьДетали1, ВыборкаПост.Уровень() + 1);
			ТабДок.Вывести(ОбластьДетали2, ВыборкаПост.Уровень() + 1);
			Попытка 
				Число = ИА_Статистики.ФЧ(1024); //Если модуля статистик нету, то статистики не выведутся
				тз = ПолучитьПоказателиСтатистик(ВыборкаПост.Пост, Период.ДатаНачала, Период.ДатаОкончания);
				СтруктураОбъект = Новый Структура;
				СтруктураОбъект.Вставить("ДатаКонца", Период.ДатаОкончания);
				СтруктураОбъект.Вставить("ДатаНачала", Период.ДатаНачала);
				СтруктураОбъект.Вставить("Настройка", НастройкаСтатистик);
				
				СтрокаДереваЗначений = Новый Структура;
				
				Если тз <> Неопределено Тогда
					Для каждого стр из тз Цикл
						ЗаполнитьЗначенияСвойств(ОбластьДетали3.Параметры, стр);
						ТабДок.Вывести(ОбластьДетали3, ВыборкаПост.Уровень() + 2);
					КонецЦикла;
				КонецЕсли;
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			
			//УдалитьСтрокиИзТЗ(масВх, тзВходящие);
			//УдалитьСтрокиИзТЗ(масВРаботе, тзВРаботе);
			//УдалитьСтрокиИзТЗ(масИсх, тзИсходящие);
			//УдалитьСтрокиИзТЗ(масВсе, тзВсе);
			//УдалитьСтрокиИзТЗ(масВыполненные, тзВыполненные);
						
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.ФиксацияСверху = 6;
    ТабДок.ФиксацияСлева = 5;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоПоФизлицу(тзВсе, Физлицо)
	
	ОтборП = Новый Структура("ПользовательФизлицо", Физлицо);
	ОтборА = Новый Структура("АвторФизлицо", Физлицо);
	тзВсеП = тзВсе.Скопировать();
	тзВсеА = тзВсе.Скопировать();
	
	тзВсеП.Свернуть("Задача, ПользовательФизлицо"); 
	тзВсеА.Свернуть("Задача, АвторФизлицо");
	ИА_БФС.ТЗ_ЗаполнитьПоТаблице(тзВсеП, тзВсеА, Ложь);
	тзВсеП.Свернуть("Задача");
	          	
	Возврат тзВсеП.Количество();
	

КонецФункции // ПолучитьКоличествоПоФизлицу()


&НаСервереБезКонтекста
Функция УдалитьСтрокиИзТЗ(МассивСтрок, ТаблицаЗначений)

	Для каждого с из МассивСтрок Цикл
		ТаблицаЗначений.Удалить(с);
	КонецЦикла;

КонецФункции // УдалитьСтрокиИзТЗ()


&НаКлиенте
Процедура ВывестиОтчет(Команда)
	
	//Если Не ЗначениеЗаполнено(Организация) Тогда
	//	Предупреждение("Не выбрана организация");
	//	Возврат;
	//КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Или Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ПоказатьПредупреждение(,"Не выбран период");
		Возврат;
	КонецЕсли;	
	
	ВывестиОтчетНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВходящие(ДатаНачала = '00010101000000', ДатаОкончания = '00010101000000')

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИА_ЗадачаПланаДействий.Ссылка КАК Задача,
	                      |	ИА_ЗадачаПланаДействий.Пост КАК Пост,
	                      |	ВЫБОР
	                      |		КОГДА ИА_ЗадачаПланаДействий.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                      |			ТОГДА ИА_АдресацияЗадачПланаДействий.Пользователь
	                      |		ИНАЧЕ ИА_ЗадачаПланаДействий.Пользователь
	                      |	КОНЕЦ КАК Пользователь
	                      |ПОМЕСТИТЬ ВТЗадачиПользователяНаПосту
	                      |ИЗ
	                      |	Задача.ИА_ЗадачаПланаДействий КАК ИА_ЗадачаПланаДействий
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	                      |		ПО ИА_ЗадачаПланаДействий.Пост = ИА_АдресацияЗадачПланаДействий.Пост
	                      |			И (ИА_АдресацияЗадачПланаДействий.Пользователь В (&Пользователь))
	                      |ГДЕ
	                      |	(ИА_ЗадачаПланаДействий.Пост = ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка)
	                      |			ИЛИ НЕ ИА_АдресацияЗадачПланаДействий.Пользователь ЕСТЬ NULL )
	                      |	И НЕ ИА_ЗадачаПланаДействий.Выполнена
	                      |	И НЕ ИА_ЗадачаПланаДействий.Отложена
	                      |	И ИА_ЗадачаПланаДействий.Отправлена
	                      |	И НЕ ИА_ЗадачаПланаДействий.ПометкаУдаления
	                      |	И ИА_ЗадачаПланаДействий.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Пост,
	                      |	ВТЗадачиПользователяНаПосту.Пользователь,
	                      |	ИА_ДанныеФизЛиц.ФизЛицо КАК ФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	                      |		ПО ВТЗадачиПользователяНаПосту.Пользователь = ИА_ДанныеФизЛиц.Пользователь");
						  
						  
	//ПроверитьФизЛицоВЗапросе(Запрос);
	
	ДатаНачала = ?(ДатаНачала = Дата("00010101000000"), Дата(1900, 1, 1, 0, 0, 0), ДатаНачала);
	ДатаОкончания = ?(ДатаОкончания = Дата("00010101000000"), Дата(2100, 1, 1, 0, 0, 0), КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Пользователь", ПолучитьПользователей());
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
						  
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьВходящие()

&НаСервереБезКонтекста
Функция ПолучитьВРаботе(ДатаНачала = '00010101000000', ДатаОкончания = '00010101000000')
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИА_ЗадачаПланаДействий.Ссылка КАК Задача,
	                      |	ИА_ЗадачаПланаДействий.Пост,
	                      |	ВЫБОР
	                      |		КОГДА ИА_ЗадачаПланаДействий.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                      |			ТОГДА ИА_АдресацияЗадачПланаДействий.Пользователь
	                      |		ИНАЧЕ ИА_ЗадачаПланаДействий.Пользователь
	                      |	КОНЕЦ КАК Пользователь
	                      |ПОМЕСТИТЬ ВТЗадачиПользователяНаПосту
	                      |ИЗ
	                      |	Задача.ИА_ЗадачаПланаДействий КАК ИА_ЗадачаПланаДействий
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	                      |		ПО (ИА_АдресацияЗадачПланаДействий.Пользователь В (&Пользователь))
	                      |			И ИА_ЗадачаПланаДействий.Пост = ИА_АдресацияЗадачПланаДействий.Пост
	                      |ГДЕ
	                      |	(ИА_ЗадачаПланаДействий.Пост = ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка)
	                      |			ИЛИ НЕ ИА_АдресацияЗадачПланаДействий.Пользователь ЕСТЬ NULL )
	                      |	И НЕ ИА_ЗадачаПланаДействий.Выполнена
	                      |	И ИА_ЗадачаПланаДействий.Отложена
	                      |	И ИА_ЗадачаПланаДействий.Отправлена
	                      |	И НЕ ИА_ЗадачаПланаДействий.ПометкаУдаления
	                      |	И ИА_ЗадачаПланаДействий.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Пост,
	                      |	ВТЗадачиПользователяНаПосту.Пользователь,
	                      |	ИА_ДанныеФизЛиц.ФизЛицо КАК ФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	                      |		ПО ВТЗадачиПользователяНаПосту.Пользователь = ИА_ДанныеФизЛиц.Пользователь");
	//ПроверитьФизЛицоВЗапросе(Запрос);
	ДатаНачала = ?(ДатаНачала = Дата("00010101000000"), Дата(1900, 1, 1, 0, 0, 0), ДатаНачала);
	ДатаОкончания = ?(ДатаОкончания = Дата("00010101000000"), Дата(2100, 1, 1, 0, 0, 0), КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Пользователь", ПолучитьПользователей());
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Возврат Запрос.Выполнить().Выгрузить();					  
						  
КонецФункции // ПолучитьВРаботе()

&НаСервереБезКонтекста
Функция ПолучитьИсходящие(ДатаНачала = '00010101000000', ДатаОкончания = '00010101000000')

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗадачаИА_ЗадачаПланаДействий.Ссылка КАК Задача,
	                      |	ВЫБОР
	                      |		КОГДА ЗадачаИА_ЗадачаПланаДействий.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                      |			ТОГДА ИА_АдресацияЗадачПланаДействий.Пользователь
	                      |		ИНАЧЕ ЗадачаИА_ЗадачаПланаДействий.Пользователь
	                      |	КОНЕЦ КАК Пользователь,
	                      |	ЗадачаИА_ЗадачаПланаДействий.Пост,
	                      |	ЗадачаИА_ЗадачаПланаДействий.Автор КАК Автор
	                      |ПОМЕСТИТЬ ВТЗадачиПользователяНаПосту
	                      |ИЗ
	                      |	Задача.ИА_ЗадачаПланаДействий КАК ЗадачаИА_ЗадачаПланаДействий
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			МаршрутПередачи.Ссылка КАК Задача
	                      |		ИЗ
	                      |			Задача.ИА_ЗадачаПланаДействий.МаршрутПередачи КАК МаршрутПередачи
	                      |		ГДЕ
	                      |			МаршрутПередачи.Пользователь В(&Пользователь)
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			МаршрутПередачи.Ссылка) КАК МаршрутПер
	                      |		ПО ЗадачаИА_ЗадачаПланаДействий.Ссылка = МаршрутПер.Задача
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	                      |		ПО ЗадачаИА_ЗадачаПланаДействий.Пост = ИА_АдресацияЗадачПланаДействий.Пост
	                      |ГДЕ
	                      |	(ЗадачаИА_ЗадачаПланаДействий.Автор В (&Пользователь)
	                      |			ИЛИ НЕ МаршрутПер.Задача ЕСТЬ NULL )
	                      |	И ЗадачаИА_ЗадачаПланаДействий.ЭтоПослание = ЛОЖЬ
	                      |	И НЕ ЗадачаИА_ЗадачаПланаДействий.Выполнена
	                      |	И ЗадачаИА_ЗадачаПланаДействий.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                      |	И ЗадачаИА_ЗадачаПланаДействий.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Пользователь,
	                      |	ИА_ДанныеФизЛиц.ФизЛицо КАК ПользовательФизЛицо
	                      |ПОМЕСТИТЬ ВТЗадачаПользовательФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	                      |		ПО ВТЗадачиПользователяНаПосту.Пользователь = ИА_ДанныеФизЛиц.Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Автор,
	                      |	ИА_ДанныеФизЛиц.ФизЛицо КАК АвторФизЛицо
	                      |ПОМЕСТИТЬ ВТЗадачаАвторФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	                      |		ПО ВТЗадачиПользователяНаПосту.Автор = ИА_ДанныеФизЛиц.Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Пользователь,
	                      |	ВТЗадачиПользователяНаПосту.Автор,
	                      |	ВТЗадачиПользователяНаПосту.Пост,
	                      |	ВТЗадачаПользовательФизЛицо.ПользовательФизЛицо КАК ПользовательФизЛицо,
	                      |	ВТЗадачаАвторФизЛицо.АвторФизЛицо КАК ФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗадачаПользовательФизЛицо КАК ВТЗадачаПользовательФизЛицо
	                      |		ПО ВТЗадачиПользователяНаПосту.Задача = ВТЗадачаПользовательФизЛицо.Задача
	                      |			И ВТЗадачиПользователяНаПосту.Пользователь = ВТЗадачаПользовательФизЛицо.Пользователь
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗадачаАвторФизЛицо КАК ВТЗадачаАвторФизЛицо
	                      |		ПО ВТЗадачиПользователяНаПосту.Задача = ВТЗадачаАвторФизЛицо.Задача
	                      |			И ВТЗадачиПользователяНаПосту.Автор = ВТЗадачаАвторФизЛицо.Автор");
	//ПроверитьФизЛицоВЗапросе(Запрос);
	ДатаНачала = ?(ДатаНачала = Дата("00010101000000"), Дата(1900, 1, 1, 0, 0, 0), ДатаНачала);
	ДатаОкончания = ?(ДатаОкончания = Дата("00010101000000"), Дата(2100, 1, 1, 0, 0, 0), КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Пользователь", ПолучитьПользователей());
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Возврат Запрос.Выполнить().Выгрузить();
						  
КонецФункции // ПолучитьИсходящие()

&НаСервереБезКонтекста
Функция ПолучитьВсе(ДатаНачала = '00010101000000', ДатаОкончания = '00010101000000')

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ЗадачаИА_ЗадачаПланаДействий.Ссылка КАК Задача,
	                      |	ВЫБОР
	                      |		КОГДА ЗадачаИА_ЗадачаПланаДействий.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                      |			ТОГДА ИА_АдресацияЗадачПланаДействий.Пользователь
	                      |		ИНАЧЕ ЗадачаИА_ЗадачаПланаДействий.Пользователь
	                      |	КОНЕЦ КАК Пользователь,
	                      |	ЗадачаИА_ЗадачаПланаДействий.Пост,
	                      |	ЗадачаИА_ЗадачаПланаДействий.Автор
	                      |ПОМЕСТИТЬ ВТЗадачиПользователяНаПосту
	                      |ИЗ
	                      |	Задача.ИА_ЗадачаПланаДействий КАК ЗадачаИА_ЗадачаПланаДействий
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	                      |		ПО ЗадачаИА_ЗадачаПланаДействий.Пост = ИА_АдресацияЗадачПланаДействий.Пост
	                      |ГДЕ
	                      |	НЕ ЗадачаИА_ЗадачаПланаДействий.ПометкаУдаления
	                      |	И ЗадачаИА_ЗадачаПланаДействий.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Пользователь,
	                      |	ИА_ДанныеФизЛиц.ФизЛицо КАК ПользовательФизЛицо
	                      |ПОМЕСТИТЬ ВТЗадачаПользовательФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	                      |		ПО ВТЗадачиПользователяНаПосту.Пользователь = ИА_ДанныеФизЛиц.Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Автор,
	                      |	ИА_ДанныеФизЛиц.ФизЛицо КАК АвторФизЛицо
	                      |ПОМЕСТИТЬ ВТЗадачаАвторФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	                      |		ПО ВТЗадачиПользователяНаПосту.Автор = ИА_ДанныеФизЛиц.Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Пользователь,
	                      |	ВТЗадачиПользователяНаПосту.Автор,
	                      |	ВТЗадачиПользователяНаПосту.Пост,
	                      |	ВТЗадачаПользовательФизЛицо.ПользовательФизЛицо КАК ПользовательФизЛицо,
	                      |	ВТЗадачаАвторФизЛицо.АвторФизЛицо КАК АвторФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗадачаПользовательФизЛицо КАК ВТЗадачаПользовательФизЛицо
	                      |		ПО ВТЗадачиПользователяНаПосту.Задача = ВТЗадачаПользовательФизЛицо.Задача
	                      |			И ВТЗадачиПользователяНаПосту.Пользователь = ВТЗадачаПользовательФизЛицо.Пользователь
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗадачаАвторФизЛицо КАК ВТЗадачаАвторФизЛицо
	                      |		ПО ВТЗадачиПользователяНаПосту.Задача = ВТЗадачаАвторФизЛицо.Задача
	                      |			И ВТЗадачиПользователяНаПосту.Автор = ВТЗадачаАвторФизЛицо.Автор");
						  
	//ПроверитьФизЛицоВЗапросе(Запрос);
	
	ДатаНачала = ?(ДатаНачала = Дата("00010101000000"), Дата(1900, 1, 1, 0, 0, 0), ДатаНачала);
	ДатаОкончания = ?(ДатаОкончания = Дата("00010101000000"), Дата(2100, 1, 1, 0, 0, 0), КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
						  
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьВсе()

&НаСервереБезКонтекста
Функция ПолучитьВыполненные(ДатаНачала = '00010101000000', ДатаОкончания = '00010101000000')

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИА_ЗадачаПланаДействий.Ссылка КАК Задача,
	                      |	ИА_ЗадачаПланаДействий.Пост КАК Пост,
	                      |	ИА_ЗадачаПланаДействий.Автор КАК Автор,
	                      |	ВЫБОР
	                      |		КОГДА ИА_ЗадачаПланаДействий.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                      |			ТОГДА ИА_АдресацияЗадачПланаДействий.Пользователь
	                      |		ИНАЧЕ ИА_ЗадачаПланаДействий.Пользователь
	                      |	КОНЕЦ КАК Пользователь
	                      |ПОМЕСТИТЬ ВТЗадачиПользователяНаПосту
	                      |ИЗ
	                      |	Задача.ИА_ЗадачаПланаДействий КАК ИА_ЗадачаПланаДействий
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	                      |		ПО ИА_ЗадачаПланаДействий.Пост = ИА_АдресацияЗадачПланаДействий.Пост
	                      |			И (ИА_АдресацияЗадачПланаДействий.Пользователь В (&Пользователь))
	                      |ГДЕ
	                      |	(ИА_ЗадачаПланаДействий.Пост = ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка)
	                      |			ИЛИ НЕ ИА_АдресацияЗадачПланаДействий.Пользователь ЕСТЬ NULL )
	                      |	И ИА_ЗадачаПланаДействий.Выполнена
	                      |	И НЕ ИА_ЗадачаПланаДействий.ПометкаУдаления
	                      |	И ИА_ЗадачаПланаДействий.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Пользователь,
	                      |	ИА_ДанныеФизЛиц.ФизЛицо КАК ПользовательФизЛицо
	                      |ПОМЕСТИТЬ ВТЗадачаПользовательФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	                      |		ПО ВТЗадачиПользователяНаПосту.Пользователь = ИА_ДанныеФизЛиц.Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Автор,
	                      |	ИА_ДанныеФизЛиц.ФизЛицо КАК АвторФизЛицо
	                      |ПОМЕСТИТЬ ВТЗадачаАвторФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	                      |		ПО ВТЗадачиПользователяНаПосту.Автор = ИА_ДанныеФизЛиц.Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЗадачиПользователяНаПосту.Задача,
	                      |	ВТЗадачиПользователяНаПосту.Пользователь,
	                      |	ВТЗадачиПользователяНаПосту.Автор,
	                      |	ВТЗадачиПользователяНаПосту.Пост,
	                      |	ВТЗадачаПользовательФизЛицо.ПользовательФизЛицо КАК ПользовательФизЛицо,
	                      |	ВТЗадачаАвторФизЛицо.АвторФизЛицо КАК АвторФизЛицо
	                      |ИЗ
	                      |	ВТЗадачиПользователяНаПосту КАК ВТЗадачиПользователяНаПосту
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗадачаПользовательФизЛицо КАК ВТЗадачаПользовательФизЛицо
	                      |		ПО ВТЗадачиПользователяНаПосту.Задача = ВТЗадачаПользовательФизЛицо.Задача
	                      |			И ВТЗадачиПользователяНаПосту.Пользователь = ВТЗадачаПользовательФизЛицо.Пользователь
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗадачаАвторФизЛицо КАК ВТЗадачаАвторФизЛицо
	                      |		ПО ВТЗадачиПользователяНаПосту.Задача = ВТЗадачаАвторФизЛицо.Задача
	                      |			И ВТЗадачиПользователяНаПосту.Автор = ВТЗадачаАвторФизЛицо.Автор");
	ПроверитьФизЛицоВЗапросе(Запрос);
	ДатаНачала = ?(ДатаНачала = Дата("00010101000000"), Дата(1900, 1, 1, 0, 0, 0), ДатаНачала);
	ДатаОкончания = ?(ДатаОкончания = Дата("00010101000000"), Дата(2100, 1, 1, 0, 0, 0), КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Пользователь", ПолучитьПользователей());
						  
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьВыполненные()

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	мас = ОрганизацияНачалоВыбораНаСервере();
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(мас);
	ВыбОрганизация = Неопределено;

	Список.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ОрганизацияНачалоВыбораЗавершение", ЭтотОбъект), "Выберите организацию");	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ВыбОрганизация = ВыбранныйЭлемент;
	
	Если ВыбОрганизация <> Неопределено Тогда
		Организация = ВыбОрганизация.Значение;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОрганизацияНачалоВыбораНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОргСхема.Ссылка 
	                      |ИЗ
	                      |	Справочник.ОргСхема КАК ОргСхема
	                      |ГДЕ
	                      |	НЕ ОргСхема.ПометкаУдаления
	                      |	И ОргСхема.ТипТерминала = ЗНАЧЕНИЕ(Перечисление.ТипТерминалаОргсхемы.Организация)");
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПоказателиСтатистик(Пост, ДатаНачала = '00010101000000', ДатаОкончания = '00010101000000')

	Если Не ЗначениеЗаполнено(Пост.НастройкаСтатистик) Тогда
		Возврат Неопределено;
	КонецЕсли;
	тзПоказатели = Новый ТаблицаЗначений;
	тзПоказатели.Колонки.Добавить("ВидСтатистики");
	тзПоказатели.Колонки.Добавить("Аналитика1");
	тзПоказатели.Колонки.Добавить("Аналитика2");
	тзПоказатели.Колонки.Добавить("Аналитика3");
	тзПоказатели.Колонки.Добавить("Количество");
	
	ДатаНачала = ?(ДатаНачала = Дата("00010101000000"), Дата(1990, 1, 1, 0, 0, 0), ДатаНачала);
	ДатаОкончания = ?(ДатаОкончания = Дата("00010101000000"), Дата(2100, 1, 1, 0, 0, 0), КонецДня(ДатаОкончания));

	Для каждого с из Пост.НастройкаСтатистик.Статистики Цикл
		Данные = ПолучитьЗначениеСтатистики(с.ВидСтатистики, с.Аналитика1,  с.Аналитика2,  с.Аналитика3, ДатаНачала, ДатаОкончания);
	
		стрПоказ = тзПоказатели.Добавить();
		ЗаполнитьЗначенияСвойств(стрПоказ, с);
		Если с.ВидСтатистики.ВидИтогов = Перечисления.ИА_ВидыИтогов.Сумма Тогда
			стрПоказ.Количество = Данные.Итог("Количество");
		ИначеЕсли с.ВидСтатистики.ВидИтогов = Перечисления.ИА_ВидыИтогов.СреднееЗначение Тогда
			КоличествоДанных = Данные.Количество();
			Если КоличествоДанных = 0 Тогда
				стрПоказ.Количество = 0;
			Иначе	
				стрПоказ.Количество = Окр(Данные.Итог("Количество") / КоличествоДанных, 2, 2);
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;

	Возврат тзПоказатели;
	
КонецФункции // ПолучитьПоказателиСтатистик()

&НаСервереБезКонтекста
Функция ПолучитьЗначениеСтатистики(пВидСтатистики, пАналитика1, пАналитика2, пАналитика3, пДатаНачала, пДатаКонца)
	ДатаНач = НачалоДня(пДатаНачала);
	ДатаКон = КонецДня(пДатаКонца);
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("ДатаНачала");
	Данные.Колонки.Добавить("ДатаКонца");
	Новстр = Данные.Добавить();
	Новстр.ДатаНачала = ДатаНач;
	Новстр.ДатаКонца = ДатаКон;
	СтрокаСтатистик = Новый Структура("ВидСтатистики,Аналитика1,Аналитика2,Аналитика3,Данные",пВидСтатистики, пАналитика1, пАналитика2, пАналитика3,Данные);
	
	ТЗ = ИА_Защита_Статистика.ПолучитьТЗДанныеСтатистики(СтрокаСтатистик,ДатаНач,ДатаКон);
	
	возврат тз;
КонецФункции

&НаКлиенте
Процедура ПостНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//Если Не ЗначениеЗаполнено(Организация) Тогда
	//	Предупреждение("Не выбрана организация");
	//	Возврат;
	//КонецЕсли;
	масПостыОрганизации = ПостНачалоВыбораНаСервере(Организация);
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(масПостыОрганизации);
	ДанныеВыбора = Список;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПостНачалоВыбораНаСервере(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	НЕ ОргСхема.ПометкаУдаления
	               |	И ОргСхема.ЭтоГруппа
	               |	И НЕ ОргСхема.ТипТерминала = ЗНАЧЕНИЕ(Перечисление.ТипТерминалаОргсхемы.Организация)";
				   Если ЗначениеЗаполнено(Организация) Тогда
					   Запрос.Текст = Запрос.Текст + " И ОргСхема.Ссылка В ИЕРАРХИИ(&Ссылка)";	
					   Запрос.УстановитьПараметр("Ссылка", Организация);			   
				   КонецЕсли;
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз.ВыгрузитьКолонку("Ссылка");	
	
КонецФункции

&НаКлиенте
Процедура ТолькоНезанятыеПостыПриИзменении(Элемент)
	
	Если ТолькоНезанятыеПосты Тогда
		Пост = Неопределено;
		Сотрудник = Неопределено;
		Элементы.Сотрудник.Доступность = Ложь;
		Элементы.Пост.Доступность = Ложь;
	Иначе
		Элементы.Сотрудник.Доступность = Истина;
		Элементы.Пост.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьПользователей()
	Запрос = Новый Запрос;
	Если Метаданные.Справочники.Пользователи.Иерархический Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ЭтоГруппа
		|	И НЕ Пользователи.ПометкаУдаления";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления";
	КонецЕсли;
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз.ВыгрузитьКолонку("Пользователь");

КонецФункции // ПолучитьПользователей()

&НаСервереБезКонтекста
Процедура ПроверитьФизЛицоВЗапросе(Запрос)
	
	//Арчил Тваладзе 2016.04.26
	// процедура не нужна но пусть Пока будет ничего страшного она не делает
	ТекстФизЛицо = "ФизЛицо";
	Попытка
		ПустойПольз = Справочники.Пользователи.ПустаяСсылка();
		фл = ПустойПольз.ФизическоеЛицо;
		ТекстФизЛицо = "ФизическоеЛицо";
	Исключение
	Конецпопытки;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ФизЛицо>", ТекстФизЛицо);

КонецПроцедуры // ПроверитьФизЛицоВЗапросе()
